demo6_geo-location/configs/update-sp.xml

<!--
  ~ Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd"
                  xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd"
                  xmlns:xsd2="http://script.model.common.application.identity.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <xsd:updateApplication>
            <!--Optional:-->
            <xsd:serviceProvider>
                <!--Optional:-->
                <xsd1:applicationID>${APP_ID}</xsd1:applicationID>
                <!--Optional:-->
                <xsd1:applicationName>${SP_NAME}</xsd1:applicationName>
                <!--Optional:-->
                <xsd1:claimConfig>
                    <!--Optional:-->
                    <xsd1:alwaysSendMappedLocalSubjectId>false</xsd1:alwaysSendMappedLocalSubjectId>
                    <!--Optional:-->
                    <xsd1:localClaimDialect>true</xsd1:localClaimDialect>
                    <!--Optional:-->
                    <xsd1:roleClaimURI>http://wso2.org/claims/role</xsd1:roleClaimURI>
                </xsd1:claimConfig>
                <!--Optional:-->
                <xsd1:description>Sample service provider for ${SP_NAME} Web Application</xsd1:description>
                <!--Optional:-->
                <xsd1:inboundAuthenticationConfig>
                    <xsd1:inboundAuthenticationRequestConfigs>
                        <xsd1:inboundAuthKey>pickupApplicationClientId</xsd1:inboundAuthKey>
                        <xsd1:inboundAuthType>oauth2</xsd1:inboundAuthType>
                        <xsd1:properties>
                            <xsd1:name>oauthConsumerSecret</xsd1:name>
                            <xsd1:value>pickupApplicationClientSecret</xsd1:value>
                        </xsd1:properties>
                    </xsd1:inboundAuthenticationRequestConfigs>
                    <xsd1:inboundAuthenticationRequestConfigs>
                        <xsd1:inboundAuthKey>application_pickup</xsd1:inboundAuthKey>
                        <xsd1:inboundAuthType>passivests</xsd1:inboundAuthType>
                    </xsd1:inboundAuthenticationRequestConfigs>
                    <xsd1:inboundAuthenticationRequestConfigs>
                        <xsd1:inboundAuthKey>application_pickup</xsd1:inboundAuthKey>
                        <xsd1:inboundAuthType>openid</xsd1:inboundAuthType>
                    </xsd1:inboundAuthenticationRequestConfigs>
                </xsd1:inboundAuthenticationConfig>
                <!--Optional:-->
                <xsd1:inboundProvisioningConfig>
                    <!--Optional:-->
                    <xsd1:dumbMode>false</xsd1:dumbMode>
                    <!--Optional:-->
                    <xsd1:provisioningUserStore>PRIMARY</xsd1:provisioningUserStore>
                </xsd1:inboundProvisioningConfig>
                <!--Optional:-->
                <xsd1:localAndOutBoundAuthenticationConfig>
                    <!--Optional:-->
                    <xsd1:alwaysSendBackAuthenticatedListOfIdPs>false</xsd1:alwaysSendBackAuthenticatedListOfIdPs>
                    <!--Optional:-->
                    <xsd1:authenticationScriptConfig>
                        <!--Optional:-->
                        <xsd2:content>&#xd;
// IP-Based from Template...&#xd;
&#xd;
// This script will step up authentication for any user who are trying to log in outside from the configured network&#xd;
&#xd;
// Configure the network ranges here&#xd;
var corpNetwork = ['213.184.123.180/24'];&#xd;
&#xd;
function onLoginRequest(context) {&#xd;
    executeStep(1, {&#xd;
        onSuccess: function (context) {&#xd;
            var user = context.currentKnownSubject;&#xd;
            // Extracting the origin IP of the request&#xd;
            var loginIp = context.request.ip;&#xd;
            Log.info('User: ' + user.username + ' logged in from IP: ' + loginIp);&#xd;
            // Checking if the IP is within the allowed range&#xd;
            if (!isCorporateIP(loginIp, corpNetwork)) {&#xd;
                executeStep(2);&#xd;
            }&#xd;
        }&#xd;
    });&#xd;
}&#xd;
&#xd;
// Function to convert ip address string to long value&#xd;
function convertIpToLong(ip) {&#xd;
    var components = ip.split('.');&#xd;
    if (components) {&#xd;
        var ipAddr = 0, pow = 1;&#xd;
        for (var i = 3; i >= 0; i -= 1) {&#xd;
            ipAddr += pow * parseInt(components[i]);&#xd;
            pow *= 256;&#xd;
        }&#xd;
        return ipAddr;&#xd;
    } else {&#xd;
        return -1;&#xd;
    }&#xd;
}&#xd;
&#xd;
// Function to check if the ip address is within the given subnet&#xd;
function isCorporateIP(ip, subnets) {&#xd;
    var subnetLength = subnets.length;&#xd;
    for (var i = 0; i &lt; subnetLength; i++) {&#xd;
        var subnetComponents = subnets[i].split('/');&#xd;
        var minHost = convertIpToLong(subnetComponents[0]);&#xd;
        var ipAddr = convertIpToLong(ip);&#xd;
        var mask = subnetComponents[1];&#xd;
        if (subnetComponents &amp;&amp; minHost >= 0) {&#xd;
            var numHosts = Math.pow(2, 32 - parseInt(mask));&#xd;
            if ((ipAddr >= minHost) &amp;&amp; (ipAddr &lt;= minHost + numHosts - 1)) {&#xd;
                return true;&#xd;
            }&#xd;
        }&#xd;
    }&#xd;
    return false;&#xd;
}&#xd;
&#xd;
// End of IP-Based.......&#xd;
</xsd2:content>
                        <!--Optional:-->
                        <xsd2:enabled>true</xsd2:enabled>
                    </xsd1:authenticationScriptConfig>
                    <!--Optional:-->
                    <xsd1:authenticationStepForAttributes/>
                    <!--Optional:-->
                    <xsd1:authenticationStepForSubject/>
                    <!--Zero or more repetitions:-->
                    <xsd1:authenticationSteps>
                                    <xsd1:attributeStep>true</xsd1:attributeStep>
                                    <xsd1:localAuthenticatorConfigs>
                                        <xsd1:displayName>basic</xsd1:displayName>
                                        <xsd1:enabled>false</xsd1:enabled>
                                        <xsd1:name>BasicAuthenticator</xsd1:name>
                                        <xsd1:valid>true</xsd1:valid>
                                    </xsd1:localAuthenticatorConfigs>
                                    <xsd1:stepOrder>1</xsd1:stepOrder>
                                    <xsd1:subjectStep>true</xsd1:subjectStep>
                                </xsd1:authenticationSteps>
                                <xsd1:authenticationSteps>
                                    <xsd1:attributeStep>false</xsd1:attributeStep>
                                    <xsd1:federatedIdentityProviders>
                                    <xsd1:claimConfig/>
                                    <xsd1:defaultAuthenticatorConfig>
                                        <xsd1:displayName>SMSOTP</xsd1:displayName>
                                        <xsd1:enabled>false</xsd1:enabled>
                                        <xsd1:name>SMSOTP</xsd1:name>
                                        <xsd1:valid>true</xsd1:valid>
                                    </xsd1:defaultAuthenticatorConfig>
                                    <xsd1:defaultProvisioningConnectorConfig/>
                                        <xsd1:enable>false</xsd1:enable>
                                        <xsd1:federatedAuthenticatorConfigs>
                                            <xsd1:displayName>SMSOTP</xsd1:displayName>
                                            <xsd1:enabled>false</xsd1:enabled>
                                            <xsd1:name>SMSOTP</xsd1:name>
                                            <xsd1:valid>true</xsd1:valid>
                                        </xsd1:federatedAuthenticatorConfigs>
                                        <xsd1:federationHub>false</xsd1:federationHub>
                                        <xsd1:identityProviderName>SMS_OTP</xsd1:identityProviderName>
                                        <xsd1:justInTimeProvisioningConfig/>
                                        <xsd1:permissionAndRoleConfig/>
                                            <xsd1:primary>false</xsd1:primary>
                                        </xsd1:federatedIdentityProviders>
                                        <xsd1:stepOrder>2</xsd1:stepOrder>
                                        <xsd1:subjectStep>false</xsd1:subjectStep>
                                    </xsd1:authenticationSteps>
                                        <xsd1:authenticationType>flow</xsd1:authenticationType>
                                        <xsd1:enableAuthorization>false</xsd1:enableAuthorization>
                                        <xsd1:subjectClaimUri/>
                                <xsd1:useTenantDomainInLocalSubjectIdentifier>false</xsd1:useTenantDomainInLocalSubjectIdentifier>
                                <xsd1:useUserstoreDomainInLocalSubjectIdentifier>false</xsd1:useUserstoreDomainInLocalSubjectIdentifier>
                                            <xsd1:useUserstoreDomainInRoles>true</xsd1:useUserstoreDomainInRoles>
                </xsd1:localAndOutBoundAuthenticationConfig>
                <!--Optional:-->
                <xsd1:outboundProvisioningConfig/>
                <!--Optional:-->
                <xsd1:owner>
                    <!--Optional:-->
                    <xsd1:tenantDomain>carbon.super</xsd1:tenantDomain>
                    <!--Optional:-->
                    <xsd1:userName>admin</xsd1:userName>
                    <!--Optional:-->
                    <xsd1:userStoreDomain>PRIMARY</xsd1:userStoreDomain>
                </xsd1:owner>
                <!--Optional:-->
                <xsd1:permissionAndRoleConfig/>
                <!--Optional:-->
                <xsd1:saasApp>true</xsd1:saasApp>
            </xsd:serviceProvider>
        </xsd:updateApplication>
    </soapenv:Body>
</soapenv:Envelope>
